<template>
    <section id="guide">
        <h2>Гайд по пользованию сайтом ArtGallery</h2>
        <p>Добро пожаловать на сайт artgallery! Мы рады видеть вас здесь. Этот гайд поможет вам разобраться, как
            пользоваться нашим сайтом для обмена изображениями и общения.</p>

        <h3>1. Регистрация и Вход</h3>
        <p>
            <strong>Регистрация:</strong> Чтобы начать, вам необходимо зарегистрироваться. Нажмите на кнопку
            "Регистрация" на главной странице и заполните необходимые поля (имя пользователя, адрес электронной
            почты и пароль). После этого подтвердите свою регистрацию через электронное письмо.
        </p>
        <p>
            <strong>Вход:</strong> Если у вас уже есть аккаунт, нажмите на кнопку "Вход", введите свои учетные
            данные и нажмите "Войти".
        </p>

        <h3>2. Загрузка изображений</h3>
        <p>
            <strong>Перейдите в раздел "Загрузить":</strong> Нажмите на кнопку "Загрузить" в боковом меню.
        </p>
        <p>
            <strong>Выберите изображение:</strong> Нажмите на кнопку "Выбрать файл" и выберите изображение, которое
            вы хотите загрузить с вашего устройства. Поддерживаются форматы JPEG, PNG и GIF.
        </p>
        <p>
            <strong>Добавьте описание:</strong> Введите описание для вашего изображения в текстовое поле.
        </p>
        <p>
            <strong>Загрузите изображение:</strong> Нажмите на кнопку "Загрузить". После загрузки изображение
            появится в галерее.
        </p>

        <h3>3. Просмотр галереи</h3>
        <p>
            <strong>Перейдите в раздел "Галерея":</strong> Нажмите на кнопку "Галерея" в боковом меню, чтобы увидеть
            все загруженные изображения.
        </p>
        <p>
            <strong>Просмотр изображений:</strong> Вы можете прокручивать галерею и щелкать по изображениям, чтобы
            увидеть их в большом размере.
        </p>

        <h3>4. Общение с другими пользователями</h3>
        <p>
            <strong>Комментирование изображений:</strong> Вы можете оставить комментарии под изображениями других
            пользователей, чтобы обсудить их работы или задать вопросы.
        </p>
        <p>
            <strong>Обратная связь:</strong> Если у вас есть вопросы или предложения, вы можете связаться с нами
            через раздел "Контакты" или оставить отзыв в соответствующем разделе.
        </p>

        <h3>5. Помощь и поддержка</h3>
        <p>
            Если у вас возникли проблемы с использованием сайта, вы можете обратиться в раздел "Помощь". Здесь вы
            найдете ответы на часто задаваемые вопросы и инструкции по решению распространенных проблем.
        </p>

        <h3>6. Безопасность и конфиденциальность</h3>
        <p>
            Мы заботимся о вашей безопасности. Пожалуйста, не делитесь своими личными данными с другими
            пользователями и сообщайте о любых подозрительных действиях.
        </p>

        <h3>7. Выход из аккаунта</h3>
        <p>
            Чтобы выйти из своего аккаунта, нажмите на кнопку "Выход" в меню. Это обеспечит безопасность вашего
            аккаунта.
        </p>

        <h3>Заключение</h3>
        <p>
            Мы надеемся, что этот гайд поможет вам легко пользоваться нашим сайтом ArtExchange. Если у вас есть
            дополнительные вопросы, не стесняйтесь обращаться к нашей команде поддержки. Приятного
            времяпрепровождения на сайте!
        </p>
    </section>
</template>
